## OpenTofu Plan: platform/management/backup

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_data_protection_backup_vault.platform_sea_01 will be created
  + resource "azurerm_data_protection_backup_vault" "platform_sea_01" {
      + cross_region_restore_enabled = true
      + datastore_type               = "OperationalStore"
      + id                           = (known after apply)
      + immutability                 = "Unlocked"
      + location                     = "southeastasia"
      + name                         = "bvault-platform-sea-01"
      + redundancy                   = "GeoRedundant"
      + resource_group_name          = "rg-platform-backup-sea"
      + retention_duration_in_days   = 30
      + soft_delete                  = "On"
      + tags                         = {
          + "costcenter" = "cc-it-platform"
          + "env"        = "shared"
          + "iac_tool"   = "opentofu"
          + "managed_by" = "iac"
          + "org"        = "kneadcode"
          + "owner"      = "platform-engineering"
          + "portfolio"  = "coruscant"
          + "purpose"    = "platform-backup-paas"
          + "workload"   = "platform-backup"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_management_lock.rg_platform_backup_sea_cannot_delete will be created
  + resource "azurerm_management_lock" "rg_platform_backup_sea_cannot_delete" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "lock-rg-platform-backup-sea-cannot-delete"
      + scope      = (known after apply)
    }

  # azurerm_recovery_services_vault.platform_sea_01 will be created
  + resource "azurerm_recovery_services_vault" "platform_sea_01" {
      + cross_region_restore_enabled  = true
      + id                            = (known after apply)
      + immutability                  = "Unlocked"
      + location                      = "southeastasia"
      + name                          = "rsv-platform-sea-01"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-platform-backup-sea"
      + sku                           = "Standard"
      + soft_delete_enabled           = true
      + storage_mode_type             = "GeoRedundant"
      + tags                          = {
          + "costcenter" = "cc-it-platform"
          + "env"        = "shared"
          + "iac_tool"   = "opentofu"
          + "managed_by" = "iac"
          + "org"        = "kneadcode"
          + "owner"      = "platform-engineering"
          + "portfolio"  = "coruscant"
          + "purpose"    = "platform-backup-iaas"
          + "workload"   = "platform-backup"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + monitoring {
          + alerts_for_all_job_failures_enabled            = true
          + alerts_for_critical_operation_failures_enabled = true
        }
    }

  # azurerm_resource_group.platform_backup_sea will be created
  + resource "azurerm_resource_group" "platform_backup_sea" {
      + id         = (known after apply)
      + location   = "southeastasia"
      + managed_by = "iac"
      + name       = "rg-platform-backup-sea"
      + tags       = {
          + "costcenter" = "cc-it-platform"
          + "env"        = "shared"
          + "iac_tool"   = "opentofu"
          + "managed_by" = "iac"
          + "org"        = "kneadcode"
          + "owner"      = "platform-engineering"
          + "portfolio"  = "coruscant"
          + "purpose"    = "platform-backup"
          + "workload"   = "platform-backup"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
